[
  {
    "id": 1,
    "imageUrl": "assets/img/image1.jpg",
    "alt": "Page d'accueil du site Argent Bank",
    "title": "Site Argent Bank",
    "subtitle": "Implémentation du front-end d'une application bancaire avec React (Projet OpenClassrooms)",
    "description": "- Développement d'une application web complète et responsive avec React, à partir du design fourni.<br>- Intégration de Redux pour la gestion du state de l'application.<br>- Implémentation des fonctionnalités clés : accès à la page d'accueil, connexion et déconnexion des utilisateurs, consultation des informations de profil après connexion, et modification du pseudo par l'utilisateur.<br>- Application des principes de Green Code.<br>- Conception et documentation des routes API pour la gestion des transactions : visualisation des transactions mensuelles et des détails des transactions, et modification des informations de transaction.",
    "tools": "React - Redux - API - JavaScript - HTML5 - Sass",
    "icons": ["fa-react", "fa-square-js", "fa-html5", "fa-sass"],
    "github": "lien",
    "site": "lien"
  },
  {
    "id": 2,
    "imageUrl": "assets/img/kasa.png",
    "alt": "Page d'accueil du site de Kasa",
    "title": "Site Kasa",
    "subtitle": "Développement d'un site de location en React (Projet OpenClassrooms)",
    "description": "- Lancement et développement d'une plateforme web pour Kasa, en utilisant React, avec une refonte complète de l'ancien site à partir des maquettes fournies.<br>- Choix de Create React App comme technologie de bundling.<br>- Conception des composants React et des routes avec React Router, en se basant sur des maquettes Figma responsives.<br>- Fonctionnalités clés développées : composant Gallery (gestion du défilement des images avec logique de boucle, et masquage des boutons de navigation si une seule image est présente) ; composant Collapsible (implémentation de la logique pour ouvrir et fermer les Collapses).",
    "tools": "React - JavaScript - HTML5 - Sass",
    "icons": ["fa-react", "fa-square-js", "fa-html5", "fa-sass"],
    "github": "https://github.com/jdesiderio/kasa",
    "site": null
  },
  {
    "id": 3,
    "imageUrl": "assets/img/724events.png",
    "alt": "Page d'accueil du site d'une agence événementielle",
    "title": "Site 724Events",
    "subtitle": "Débugage du site vitrine d'une agence événementielle (Projet OpenClassrooms)",
    "description": "Correction de bugs pour améliorer l'expérience utilisateur sur un site vitrine one-page pour l'agence évènementielle 724events.<br>- Correction de l'affichage des mois dans l'ensemble des composants.<br>- Modification du carrousel pour afficher les événements par date en ordre décroissant, au lieu de l'ordre aléatoire initial. <br>- Réparation du filtre de la section 'Nos réalisations' pour assurer un affichage correct des réalisations.<br>- Correction du formulaire pour que le message de confirmation s'affiche après envoi.<br>- Création d'un cahier de recette pour confirmer la fiabilité du site et son adéquation avec les besoins de 724events.",
    "tools": "React - JavaScript - HTML5 - Sass",
    "icons": ["fa-react", "fa-square-js"],
    "github": "https://github.com/jdesiderio/724events",
    "site": null
  },
  {
    "id": 4,
    "imageUrl": "assets/img/sophiebluel.png",
    "alt": "page d'accueil du portfolio Sophie Bluel",
    "title": "Portfolio de Sophie Bluel",
    "subtitle": "Front-end du site portfolio d'une architecte d'intérieur (Projet OpenClassooms)",
    "description": "Développement de : <br>- La page de présentation des travaux de l'architecte ; <br>- La page de connexion de l'administrateur du site ; <br>- La modale permettant de supprimer et de charger de nouveaux médias. <br>À partir d'un back-end et d'une API fournis. <br>Apprentissage du JavaScript et des méthodes d'authentification.",
    "tools": "JavaScript - HTML5 - CSS3",
    "icons": ["fa-square-js", "fa-html5", "fa-css3-alt"],
    "github": "https://github.com/jdesiderio/sophiebluel",
    "site": null
  },
  {
    "id": 5,
    "imageUrl": "assets/img/ninacarducci.png",
    "alt": "page d'accueil du portfolio Nina Carducci",
    "title": "Portfolio de Nina Carducci",
    "subtitle": "Performance, accessibilité, SEO (Projet OpenClassooms)",
    "description": "Audit Lighthouse et amélioration du site portfolio d'une photographe : <br>- Amélioration des performances (css, images, refactorisation) <br>- Correction du code pour améliorer l'accessibilité (Wave, aria). <br>- Amélioration du référencement du site (balises meta, web sémantique) <br>Apprentissage des méthodes d'améliorations de sites web au niveau des performances, de l'accessibilité et du SEO.",
    "tools": "SEO (Lighthouse, Wave) - HTML5 - CSS3 - JavaScript",
    "icons": ["fa-html5", "fa-css3-alt", "fa-square-js"],
    "github": "https://github.com/jdesiderio/ninacarducci",
    "site": "https://jdesiderio.github.io/ninacarducci"
  }
]